<?php namespace ttools; 

// PHP7/HTML5, EDGE/CHROME                              *** ChangeClass.php ***

// ****************************************************************************
// * ittve.me              Редактировать выбранный материал или создать новый * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  04.02.2023
// Copyright © 2023 tve                              Посл.изменение: 22.03.2023

require_once "Common.php";  

class Change
{
   // ----------------------------------------------------- СВОЙСТВА КЛАССА ---
   protected $Arti; // объект по работе с базой данных материалов
   protected $apdo; // подключение к базе данных материалов
   
   // *************************************************************************
   // *         ----Проинициализировать свойства классов по настройкам сайта,     *
   // *************************************************************************
   public function __construct($Arti,$apdo) 
   {
      $this->Arti=$Arti;
      $this->apdo=$apdo;
   }
   public function __destruct() 
   {
   }
   // *************************************************************************
   // *                  ----Изменить свойства для обновления настроек            *
   // *************************************************************************
   public function Head()
   {
      // Отключаем разворачивание аккордеона
      // в случае, когда создаем заголовок новой статьи. 
      echo '
      <style>
         .accordion li .sub-menu 
         {
            height:100%;
         }
      </style>
     ';
      // Включаем рождественскую версию шрифтов и полосок меню
      //IniFontChristmas();
   }
   // *************************************************************************
   // *                  ----Изменить свойства для обновления настроек            *
   // *************************************************************************
   public function Body()
   {
      //echo 'Привет!';
      $this->Arti->MakeUniMenu($this->apdo,'','getTranslit');
      //$this->Arti->getPunktMenu($this->apdo);
   }
}

// ******************************************************** ChangeClass.php ***
