<?php

// Определяем цветности знаков юникода для $SignColor
define ("signBW",0);      // черно-белый знак
define ("signColor",1);      // черно-белый знак

// Формируем список избранных знаков юникода
$aUniCues=[
   [0,'Знаки всякие-разные',signBW,[
      ['058D','Правосторонний знак вечности'],
      ['058E','Левосторонний знак вечности'],
      ['2020','Крестик'],
      ['2021','Двойной крестик'],
      ['203B','Знак сноски'],
      ['2042','Три звездочки в виде треугольника'],
      ['2055','Цветок знак преринания'],
      ['2056','Три точки пунктуации'],
      ['2058','Четыре точки пунктуации'],
      ['2059','Пять точек пунктуации'],
      ['205C','Точечный крест']]
   ],
   [1,'Символы валют',signBW,[
      ['0024','Доллар'],
      ['058F','Армянский драм'],
      ['20A0','Знак ЭКЮ'],
      ['20A1','Сальвадорский колон'],
      ['20A2','Бразильский крузейро'],
      ['20A3','Французский франк'],
      ['20A4','Лира'],
      ['20A5','Милль'],
      ['20A6','Нигерийская найра'],
      ['20A7','Испанская песета'],
      ['20A8','Рупия'],
      ['20A9','Вулонг'],
      ['20AA','Знак нового шекеля'],
      ['20AB','Вьетнамский донг'],
      ['20AC','Евро'],
      ['20AD','Лаоский кип'],
      ['20AE','Монгольский тугрик'],
      ['20AF','Греческая драхма'],
      ['20B0','Немецкий пфенниг'],
      ['20B1','Песо'],
      ['20B2','Парагвайский гуарани'],
      ['20B3','Аргентинский аустраль'],
      ['20B4','Гривна'],
      ['20B5','Ганский седи'],
      ['20B6','Турский ливр (турнуа)'],
      ['20B7','Знак спесмило'],
      ['20B8','Казахстанский тенге'],
      ['20B9','Индийская рупия'],
      ['20BA','Турецкая лира'],
      ['20BB','Нордическая марка'],
      ['20BC','Азербайджанский манат'],
      ['20BD','Рубль'],
      ['050E','Труфанка'],
      ['20BE','Грузинский лари'],
      ['20BF','Биткойн']]
   ]
];       


// ****************************************************************************
// *                   Вывести набор юникодов одним столбцом                  *
// ****************************************************************************
function ViewCharsetAsColomn($Charpos,$aUniCues)
{
   $Charset=$aUniCues[$Charpos];
   //echo '<pre>';
   //print_r($Charset);
   //echo '</pre>';
   $SetName=$Charset[1];
   echo $SetName.'<br>'; 
   $Charset=$Charset[3];
   //echo '<pre>';
   //print_r($Charset);
   //echo '</pre>';
   foreach ($Charset as $aArray) 
   {
      $hexbeg=$aArray[0];
      $nbeg=hexdec($hexbeg);
      $hexsign=dechex($nbeg);
      if ($hexsign=='50e') $chex='<em>'.'&#x'.$hexbeg.'</em>'; else $chex='&#x'.$hexbeg; 
      echo $chex.' '.$hexbeg.'-->'.$nbeg.' '.$chex.' '.$aArray[1]."<br>";
   }
   echo '<br>'; 
}

?>
<!DOCTYPE HTML>
<html>
<head>
   <meta http-equiv="content-type" content="text/html; charset=utf-8">
   <meta name="generator" content="PSPad editor, www.pspad.com">
   <title>Подключение фонта TTF</title>
  
   <style>
   @font-face 
   {
      /* Имя шрифта для страницы */
      font-family: Emojitveme; 
      /* Путь к файлу со шрифтом */
      src: url(Fonts/Lobster/SegoeUi.ttf); 
   }
   p 
   {
      font-family: Emojitveme;
   }
   </style>
  
</head>
<body>
   Приветик! &#9755;<br>
   Протяженность варьирует &#129698; дорийский микрохроматический интервал, 
   но если бы песен было раз в пять меньше, было бы лучше для всех.
   <p>
   &#9755;<br>
   Протяженность &#9728; --> &#x2600; варьирует &#129698;  дорийский микрохроматический интервал, 
   но &#9755; если бы песен было &#879; раз &#129392; в пять меньше, было &#10052; бы лучше для всех.<br>
   <br>
<?php

// Знаки всякие-разные
ViewCharsetAsColomn(0,$aUniCues);

// Символы валют
ViewCharsetAsColomn(1,$aUniCues);
   
?>
   </p>

</body>
<!-- 
      src: url(Fonts/Lobster/Lobster-Regular.ttf); 
      src: url(Fonts/Lobster/SegoeUi.ttf); 
      src: url(Fonts/Lobster/NotoEmoji.ttf); 
      src: url(Fonts/Lobster/tri.ttf); 
-->
</html>
