<?php
// PHP7/HTML5, EDGE/CHROME                           *** ItemLeftFooter.php ***

// ****************************************************************************
// * ittve.me                  Разместить идентификацию статей (материалов) и *
// *                      обеспечить их выбор и назначение при редактировании *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  08.11.2022
// Copyright © 2022 tve                              Посл.изменение: 08.11.2022

// Разместить идентификацию статей (материалов), обеспечить их выбор 
// и назначение при редактировании 
function PlaceIdArticles()
{
   echo '<a href="#okno">';
   echo 
   'Идентификация статей (материалов)'.'<br>'.
   'обеспечение их выбора и назначение'.'<br>'.
   'при редактировании';
   echo '</a>';
}
// ***************************************************** MessLeftFooter.php ***
