<?php namespace newarti; 

// PHP7/HTML5, EDGE/CHROME                          *** NewarticleClass.php ***

// ****************************************************************************
// * ittve.me                                Добавить новый раздел материалов * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  04.02.2018
// Copyright © 2018 tve                              Посл.изменение: 12.12.2022

echo 'Добавить новый раздел материалов'.'<br>';
$Newa=new NewArticle();

class NewArticle
{
   // ----------------------------------------------------- СВОЙСТВА КЛАССА ---
   protected $urlHome;          // Начальная страница сайта 
   
   // *************************************************************************
   // *         Проинициализировать свойства классов по настройкам сайта,     *
   // *            запустить изменение свойств для обновления настроек        *
   // *************************************************************************
   public function __construct() 
   {
   }
   public function __destruct() 
   {
   }
}
// **************************************************** NewarticleClass.php ***
