<?php namespace sayme; 

// PHP7/HTML5, EDGE/CHROME                               *** SaymeClass.php ***

// ****************************************************************************
// * ittve.me                           Войти или зарегистрироваться на сайте * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  04.02.2018
// Copyright © 2018 tve                              Посл.изменение: 12.12.2022

echo 'Отправить сообщение автору'.'<br>';
$Notice=new Noticing();

class Noticing
{
   // ----------------------------------------------------- СВОЙСТВА КЛАССА ---
   protected $urlHome;          // Начальная страница сайта 
   
   // *************************************************************************
   // *         Проинициализировать свойства классов по настройкам сайта,     *
   // *            запустить изменение свойств для обновления настроек        *
   // *************************************************************************
   public function __construct() 
   {
   }
   public function __destruct() 
   {
   }
}
// ********************************************************* SaymeClass.php ***
