<?php namespace ttools; 

// PHP7/HTML5, EDGE/CHROME                              *** DelCueClass.php ***

// ****************************************************************************
// * ittve.me                                       Удалить раздел материалов * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  26.02.2023
// Copyright © 2023 tve                              Посл.изменение: 26.02.2023

class DelCue
{
   // ----------------------------------------------------- СВОЙСТВА КЛАССА ---
   protected $urlHome;          // Начальная страница сайта 
   
   // *************************************************************************
   // *         Проинициализировать свойства классов по настройкам сайта,     *
   // *            запустить изменение свойств для обновления настроек        *
   // *************************************************************************
   public function __construct() 
   {
   }
   public function __destruct() 
   {
   }
}
// ******************************************************** DelCueClass.php ***
