<?php
// PHP7/HTML5, EDGE/CHROME                                 *** iHtmlEnd.php ***

// ****************************************************************************
// * ittve.me                                       Загрузить завершение HTML * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  05.12.2018
// Copyright © 2019 tve                              Посл.изменение: 30.01.2019

?>
   </body> 
   </html>
<?php

// *********************************************************** iHtmlEnd.php ***
