<?php
// PHP7/HTML5, EDGE/CHROME                                    *** index.php ***

// ****************************************************************************
// * ittve.me                          Обо мне, путешествиях и ... Черногории *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 14.01.2019

//require_once "indPosRel.html";
//require_once "indPosAbs.html";
//require_once "indFlex.html";
require_once "Main.php";

// ************************************************************** index.php ***
