<?php
// PHP7/HTML5, EDGE/CHROME                                      *** пифи.рф ***

// ****************************************************************************
// *                                                              Люби жизнь! *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  07.01.2019
// Copyright © 2019 tve                              Посл.изменение: 08.01.2019

//require_once "indPosRel.html";
//require_once "indPosAbs.html";
//require_once "indProba.html";
//require_once "indDiv.html";
require_once "indProba2.html";
// **************************************************************** пифи.рф ***
