<?php
// PHP7/HTML5, EDGE/CHROME                                *** iniHtmlEnd.php ***

// ****************************************************************************
// * ittve.me                                       Загрузить завершение HTML * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  05.12.2018
// Copyright © 2019 tve                              Посл.изменение: 12.06.2020

echo '</body>'; 
echo '</html>';

// ********************************************************* iniHtmlEnd.php ***
