<?php
// PHP7/HTML5, EDGE/CHROME                                     *** Main.php ***

// ****************************************************************************
// * ittve.me                          Обо мне, путешествиях и ... Черногории *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  13.01.2019
// Copyright © 2019 tve                              Посл.изменение: 14.01.2019

?>
<!DOCTYPE html>
<html lang="ru">
<head>
   <title>Обо мне, путешествиях и ... Черногории</title>
   <meta charset="utf-8">
   <meta http-equiv="content-type" content="text/html; charset=utf-8"/>
   <meta name="description" content="Труфанов Владимир Евгеньевич, его жизнь и жизнь его близких">
   <meta name="keywords" content="Труфанов Владимир Евгеньевич, жизнь и увлечения">
   <link href='https://fonts.googleapis.com/css?family=Kurale' rel='stylesheet'>
   <link href="https://fonts.googleapis.com/css?family=Pattaya&subset=cyrillic" rel="stylesheet">
   <link href="https://fonts.googleapis.com/css?family=Podkova&subset=cyrillic" rel="stylesheet">
   <link rel="stylesheet" type="text/css" href="Styles/Styles.css"/>
</head>

<body>
   <!-- 
   -->
   <div class="Gallery">
  <div class="Card">1 Open First</div>
  <div class="Card">2</div>
  <div class="Card">3</div>
  <div class="Card">4</div>
  <div class="Card">11 First</div>
  <div class="Card">12</div>
  <div class="Card">13</div>
  <div class="Card">14</div>
  <div class="Card">21 First</div>
  <div class="Card">22</div>
  <div class="Card">23</div>
  <div class="Card">24</div>
  <div class="Card">31 First</div>
  <div class="Card">32</div>
  <div class="Card">33</div>
  <div class="Card">34</div>
</div>


  <section class="sidebar">
   <h1>По тропе к карнизу реки Бзерпь</h1>
<p style="text-align: justify;">Очень хорошо поменялась карта у геокэшеров, на ней появился &laquo;Вагончик на Бзерпи&raquo;, вот туда на бзерпинский карниз &ndash; на краешек горного обрыва над речкой (вот она рядом и вот она далеко внизу) и предлагаю прогуляться по тропе любителям небольших походов для поиска тайника. Тем более, что и сама тропа появилась на карте. Как и я, житель лесноозерной Карелии, люблю ходить по дебрям, есть и вы, друзья, которым будет интересно подняться в крутую гору в теплом Сочи и спуститься вниз часов за шесть.</p>
<p style="text-align: justify;">Для описания ваших ожиданий от похода я, практически, буду пересказывать материалы путешественника <span style="color: #990000;"><noindex><a href="http://www.kovinov.com/kavkaz/sochi-i-krasnaja-poljana/bzerpinskij-karniz/" target="_blank" title="Путешествия от Красной поляны"><span style="color: #990000;">Дмитрия Ковинова</span></a></noindex></span>&nbsp;с моими впечатлениями.</p>
<p style="text-align: justify;">Сезон походов на Бзерпинский карниз зависит от снеговой обстановки в горах. Начало сезона, обычно, 10 - 15 июня, окончание - в ноябре. До конца мая - начала июня на Бзерпинском карнизе еще лежит <span style="color: #990000;"><noindex><a href="http://www.kovinov.com/kavkaz/sochi-i-krasnaja-poljana/bzerpinskij-karniz/pik-bzerpi/#sneg" target="_blank" title="Снег на Бзерпинском карнизе"><span style="color: #990000;">снег</span></a></noindex></span>, а тропа на перевал, идущая над километровым обрывом вдоль северного склона горы Табунная, покрыта коркой весеннего льда. Как только тропа на перевал освобождается от льда и снега администрация Кавказского биосферного заповедника открывает маршрут. Обычно это происходит 10 - 15 июня. Лучшее время для походов - 10 июля - 20 августа. Обычно в начале октября еще по-летнему тепло, а в конце месяца ночные заморозки и сильные ветра перекрашивают лес и окружающие горы в багряно-красный цвет. В ноябре же, как правило, выпадает первый снег и маршрут закрывается.</p>
<p style="text-align: justify;">Особой специальной подготовки для похода не требуется. Весь маршрут прекрасно промаркирован, а места отдыха оборудованы скамейками и столами. Однако нужно учитывать, что маршрут проходит по территории Кавказского биосферного заповедника и перед выходом на маршрут нужно <span style="color: #990000;"><noindex><a href="https://riderhelp.ru/summer/hiking/permit/" target="_blank" title="Где получить пропуск"><span style="color: #990000;">получить пропуск</span></a></noindex></span>&nbsp;(можно заехать в Вольерный комплекс - это 3 км от центра Красной поляны, но я для того, чтобы не терять время в день похода, купил пропуск заблаговременно в Сочи). Пропуск можно и на одного человека, но нужен паспорт на &laquo;руководителя этой группы&raquo;. А также перед выходом в поход нужно зарегистрироваться в МЧС по телефону и, соответственно, отметиться при возвращении.</p>
<p style="text-align: justify;">Я сходил в поход 22 сентября (супруга отказалась рисковать, поэтому в поход ходил один), погода была солнечная и у моря, и в горах было +25 (в Розе Хутор прохладнее +23). Но как предупреждали, что погода может быстро поменяться, поэтому были с собой теплые вещи в рюкзаке, но они не пригодились.</p>
<p style="text-align: justify;">При желании и хорошей погоде на прогулку вместе с остановками на привалы-перекусы и фотографирование может хватить и 6 часов, главное не опоздать на канатку! У меня на подъем от Пихтовой поляны до карниза ушло 3 часа с 30-минутным перекусом у Медвежьих ворот, на спуск 2 часа.</p>
<p style="text-align: justify;">У домиков на Бзерпинском карнизе можно душевно перекусить тем, что донес с собой и красивым видом на горы. Да и пока поднимаешься по верхней части тропы, хорошо внизу видно начало пути, биатлонный центр с бассейном, Роза Хутор и конечно же окружающие вершины, некоторые в сентябре все еще со снегом.</p>
<p style="text-align: justify;">"Логистика" моего похода была следующей. В начале десятого на электричке выехал из Хосты. В 10 был уже на вокзале Розы Хутор, захотел перейти площадь и на самой большой, и длинной канатке от Альпики-сервис подняться до Пихтовой поляны. Но не тут-то было! Это канатная дорога закрылась 15 сентября. Пришлось идти километр с лишним до Лауры-Газпром и подниматься оттуда. В 11.05 проплывал над биатлонным центром, в 11.18 сошел с верхней станции канатки &laquo;<span style="color: #990000;">В этом здании туалет, ресторанчик и автоматы, где можно купить воды, шоколадку, а в конце похода выпить и по бокалу пенного!</span>&raquo;, стоял у начала тропы и смотрел, как потом понял, на Медвежьи ворота.</p>
<p style="text-align: justify;">Пошел вниз, как писал Дмитрий: &laquo;<span style="color: #990000;">Первые метры похода - спуск прямо по горнолыжной трассе поперёк которой прорыты дренажные канавы. Скрепя сердцем сбрасываем почти 50 метров высоты и двигаемся по левой по ходу движения грунтовой дороге. Идти по правой, перекрытой шлагбаумом не верно! Через 5-10 минут ходьбы грунтовая дорога заканчивается, а начинающаяся тропа резко поворачивает налево, забирается на гору и ныряет в лес! Здесь собственно и начинается тропа, которая круто поднимается по заповедному лесному склону, поросшему вековыми пихтами. Тропа отличного качества и заблудиться на ней невозможно. В нескольких местах она раздваивается, но не переживайте, все ответвления все равно сходятся в одну основную тропу. Поэтому смело двигайтесь по любой из них вверх, держась все время гребня!</span>&raquo;.</p>
<p style="text-align: justify;">Примерно в 12.20 вышел из леса, было очень любопытно - резко начались луга. Как оказалось, это были Медвежьи ворота. Где-то посредине этого участка подъёма попались <span style="color: #990000;"><noindex><a href="http://www.lazarevskaya.su/acanguar.html" target="_blank" title="Ацангуары"><span style="color: #990000;">ацангуары</span></a></noindex></span>, походил, посмотрел. Во время подъема окунулся в традицию похода &ndash; желать каждому, идущему по тропе здравия, здравствовать. У Медвежьих ворот стоило задержаться, что я и сделал. Перекусил, полюбовался видами, пофотографировал, почитал информацию на стендах. Подумал, как быть дальше, читая слова Дмитрия: &laquo;<span style="color: #990000;">Сразу над скамейками тропа разветвляется. Левый путь более прямой и короткий, до цели нашего похода по ней не более часа пути. Вариант с поворотом на правую тропу (указатель "пик Бзерпи" на повороте) ведёт более тяжёлым, но и более красивым маршрутом прямо через вершину горы Табунная. Если на обратном пути у вас будет настроение подняться повыше, именно по этой тропе я советую возвращаться обратно!</span>&raquo;</p>
<p style="text-align: justify;">В 13.05 двинулся дальше по более короткой дороге. До карниза тропа уже шла по лугам. Здесь она была поровнее и в 14.03 уже пил водичку из Бзерпи, и радовался новым ощущениям. Посидел на скамеечке рядом с карнизом, хотел посидеть на краю карниза и ноги свесит вниз, но вспомнил о невыплаченном кредите и остался на скамеечке. Доел остатки вкусностей, прогулялся чуть-чуть, полежал на травке, увидел цветущие, всякие-разные крокусы (так мне объяснили, теперь вживую стало понятно, почему мои некоторые дачные магазины в Петрозаводске так называются) и другую осеннюю, но цветущую горную растительную красоту. В 14.35 отправился вниз. Было сказано, что в 17.30 уходит последняя канатка, а еще нужно было закопать тайник. Место нашел, тайник закопал, чистое время на спуск - 2 часа.</p>
<p style="text-align: justify;">Сходите, уважаемые тоже. Сомневаетесь, гуглите &laquo;карниз реки бзерпь&raquo;, яндексуйте &laquo;перевал медвежьи ворота&raquo; и, скорее всего, решитесь. Всем привет и удачи!</p>  </section>

  <section class="content">
   <h1>Особенности устройства винтиков в моей голове</h1>
   <p>Физико-математический факультет ПетрГУ (ПГУ им.О.В.Кусинена в моё время) наложил на меня отпечаток. Все в моей голове строится по степеням двойки, как-то это управляет моей жизнью и упрощает её (2в0=1, 2в1=2, 2во2=4, 2в3=8, 2в4=16, …). Теплица на даче одна (или 2, в зависимости от уровня благосостояния в стране). В теплице 2 грядки. На грядке два ряда, в каждом ряду по 8, например, томатов. Когда выпекаю булочки или пирожки, их получается по 8 или 16. В слоеном тесте получается 256 слоев. Лыж пара, лыжных палок пара (иногда одна лыжа или палка ломается).<br><br>
	Но, иногда, что-то в голове щёлкает и, начинает работать система со смещением степеней двойки на единицу (2 в степени N + 1:  т.е.  9, 17, …). Например, жена заставляет повесить занавеску и к занавеске дает 20 прищепок, и у меня всегда 3 остаются лишними. Как я вешаю занавески: прищепку с правого края, прищепку с левого края. Далее возникает естественное желание повесить занавеску на скрепку по центру. Что я и делаю. Далее опять закрепляю два провиса справа и слева от центра, и так далее. И три скрепки остаются – их некуда закрепить, руки не поднимаются.<br><br>
	Правда китайская игровая философия тоже наложила отпечаток. На втором курсе университета китайская философия въехала в голову через ГО (это не гражданская оборона на военной кафедре, а вэйци, бадук – настольная игра из черных и белых камней. После нескольких лет этой болезни, все мои дела строятся по принципам этой игры: ярко выраженное стратегическое начало фусеки, как правило, вызывающее задержку на старте, собственно само дело, идущее к цели и стремительное (только не зевай) йосе, когда все ясно. Но и здесь, как видно, бинарная, двоичная основа. (А про компьютеры и программы и говорить нечего).<br><br>
</p>
  </section>
  
  <div class="btn">
  <p style="text-align:center"><button class="btni">&#9996;</button>
  </div>

 </body>
</html>

<?php
// *************************************************************** Main.php ***
