<?php namespace ttools; 
                                         
// PHP7/HTML5, EDGE/CHROME                            *** Dispatch_ZERO.php ***

// ****************************************************************************
// * TinyGalleryClass          Блок функций при загрузке страниц на фазе ZERO *
// *                                                                          *
// * v1.0, 14.03.2022                              Автор:       Труфанов В.Е. *
// * Copyright © 2022 tve                          Дата создания:  13.11.2022 *
// ****************************************************************************

// ****************************************************** Dispatch_ZERO.php ***
