<?php namespace ttools; 

// PHP7/HTML5, EDGE/CHROME                              *** DelArtClass.php ***

// ****************************************************************************
// * ittve.me                                                  Удалить статью * 
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  26.02.2023
// Copyright © 2023 tve                              Посл.изменение: 03.04.2023

require_once "Common.php";  
class DelArt
{
   // ----------------------------------------------------- СВОЙСТВА КЛАССА ---
   protected $Arti; // объект по работе с базой данных материалов
   protected $apdo; // подключение к базе данных материалов
   
   // *************************************************************************
   // *          Проинициализировать свойства класса по удалению статьи       *
   // *************************************************************************
   public function __construct($Arti,$apdo,$game=NULL) 
   {
      $this->game=$game;
      $this->Arti=$Arti;
      $this->apdo=$apdo;
      // Проверяем, нужно ли заменить файлы для аякс-запросов в корневом каталоге 
      // и (при их отсутствии, при несовпадении размеров или старой дате) 
      // загружаем из класса 
      CompareCopyRoot('deleteArt.php','ttools/TDelArt');
      CompareCopyRoot('testForDelArt.php','ttools/TDelArt');
   }
   public function __destruct() 
   {
   }
   // *************************************************************************
   // *                    Выполнить действия в фазе "HEAD"                   *
   // *************************************************************************
   public function Head() 
   {
      if ($this->game<>NULL) $this->game->Head();
      echo '<link rel="stylesheet" type="text/css" href="Styles/UniArt.css">';
      // Отключаем разворачивание аккордеона
      // в случае, когда создаем заголовок новой статьи. 
      echo '
      <style>
         .accordion li .sub-menu 
         {
            height:100%;
         }
         #WorkTiny
         {
            height:92%;
         }
      </style>
     ';
   }
   // *************************************************************************
   // *                     Выполнить действия в фазе "BODY"                  *
   // *************************************************************************
   public function Body() 
   {
      // Запускаем замещение страницы
      if ($this->game<>NULL) $this->game->Play();
      // Выводим страницу
      else
      {
         mmlUdalitMaterial_BODY($this->apdo);
      }
   }
}

// ----------------------------------------------------- ФУНКЦИИ ВНЕ КЛАССА ---

// ****************************************************************************
// *             Выполнить действия в области редактирования "WorkTiny"       *
// *                              при удалении статьи                         *
// ****************************************************************************
function mmlUdalitMaterial_BODY($pdo)
{
   UniArtMenu($pdo,'','UdalitMater');
}

// ******************************************************** DelArtClass.php ***
